load-tests/results/high-traffic-20260906-final-500x500/k6-console.log

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /work/load-tests/k6/high-traffic-500vu-10000.js
        output: -

     scenarios: (100.00%) 1 scenario, 500 max VUs, 10m30s max duration (incl. graceful stop):
              * high_traffic_booking: 500 iterations shared among 500 VUs (maxDuration: 10m0s, gracefulStop: 30s)


Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

Run                    [ 100% ] setup()
high_traffic_booking   [   0% ]

running (00m02.9s), 500/500 VUs, 0 complete and 0 interrupted iterations
high_traffic_booking   [   0% ] 500 VUs  00m00.2s/10m0s  000/500 shared iters

running (00m03.9s), 438/500 VUs, 62 complete and 0 interrupted iterations
high_traffic_booking   [  12% ] 500 VUs  00m01.2s/10m0s  062/500 shared iters


  █ TOTAL RESULTS 

    checks_total.......: 1000    232.827452/s
    checks_succeeded...: 100.00% 1000 out of 1000
    checks_failed......: 0.00%   0 out of 1000

    ✓ reservation response has an id
    ✓ reservation response is pending

    CUSTOM
    cancellations_succeeded............: 0      0/s
    errors_idempotency_in_progress.....: 0      0/s
    errors_rate_limited................: 0      0/s
    errors_sold_out....................: 0      0/s
    errors_user_limit..................: 0      0/s
    reservation_server_faults..........: 0      0/s
    reservation_unexpected_responses...: 0      0/s
    reservations_accepted..............: 500    116.413726/s
    reservations_created...............: 500    116.413726/s
    reservations_replayed..............: 0      0/s
    reserve_latency....................: avg=1.23s min=852.27ms med=1.13s p(90)=1.46s p(95)=1.47s p(99)=1.48s max=1.49s

    HTTP
    http_req_duration..................: avg=1.23s min=203.95ms med=1.13s p(90)=1.46s p(95)=1.47s p(99)=1.48s max=1.49s
      { expected_response:true }.......: avg=1.23s min=203.95ms med=1.13s p(90)=1.46s p(95)=1.47s p(99)=1.48s max=1.49s
    http_req_failed....................: 0.00%  0 out of 503
    http_reqs..........................: 503    117.112209/s

    EXECUTION
    iteration_duration.................: avg=1.28s min=861.33ms med=1.21s p(90)=1.52s p(95)=1.54s p(99)=1.58s max=1.6s 
    iterations.........................: 500    116.413726/s
    vus................................: 436    min=0        max=500
    vus_max............................: 500    min=500      max=500

    NETWORK
    data_received......................: 386 kB 90 kB/s
    data_sent..........................: 291 kB 68 kB/s



running (00m04.3s), 000/500 VUs, 500 complete and 0 interrupted iterations
high_traffic_booking ✓ [ 100% ] 500 VUs  00m01.6s/10m0s  500/500 shared iters